Revit 2026 API

# PointCollectionGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<CloudPoint> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of CloudPoint)
```
```cpp
public:
virtual IEnumerator<CloudPoint>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<CloudPoint>
override GetEnumerator : unit -> IEnumerator<CloudPoint>
```

#### Return Value

IEnumeratorCloudPointAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

PointCollection Class

Autodesk.Revit.DB.PointClouds Namespace